Repository: timpyorke/flutter-image-converter
Catalog: lib/l10n/app_*.arb
Languages: th

# appTitle
source: Image Converter
th: แปลงรูปภาพ

source: Convert
th: แปลง

source: Resize
th: ปรับขนาด

source: Settings
th: ตั้งค่า

source: Convert Images
th: แปลงรูปภาพ

source: Resize Image
th: ปรับขนาดรูปภาพ

source: Pick Images
th: เลือกรูปภาพ

source: Select Image
th: เลือกรูปภาพ

source: Select Images
th: เลือกรูปภาพ

source: Select Image to Resize
th: เลือกรูปภาพเพื่อปรับขนาด

# converting
source: Converting {current}/{total}...
th: กำลังแปลง {current}/{total}...

# convertNImages
source: Convert {count, plural, =1{1 Image} other{{count} Images}}
th: แปลง {count} รูป

# saveNImages
source: Save {count, plural, =1{1 Image} other{{count} Images}}
th: บันทึก {count} รูป

source: Conversion Complete!
th: แปลงเสร็จสิ้น!

source: Resize Complete!
th: ปรับขนาดเสร็จสิ้น!

# nImagesConvertedSuccessfully
source: {count} image(s) converted successfully
th: แปลงรูปภาพสำเร็จ {count} รูป

# yourImageResizedSuccessfully
source: Your image has been resized successfully
th: ปรับขนาดรูปภาพของคุณสำเร็จแล้ว

source: Format
th: รูปแบบ

source: Quality
th: คุณภาพ

source: Source Images
th: รูปภาพต้นฉบับ

source: Source Image
th: รูปภาพต้นฉบับ

source: Conversion Settings
th: การตั้งค่าการแปลง

source: Resize Settings
th: การตั้งค่าการปรับขนาด

source: Width
th: ความกว้าง

source: Height
th: ความสูง

source: Maintain Aspect Ratio
th: รักษาอัตราส่วนภาพ

source: Name
th: ชื่อ

source: Dimensions
th: ขนาด

source: Size
th: ขนาดไฟล์

source: Before
th: ก่อน

source: After
th: หลัง

# readyToConvert
source: Ready to convert your images?
th: พร้อมแปลงรูปภาพของคุณแล้วหรือยัง?

# thisWillConvertNImages
source: This will convert {count} image(s)
th: นี่จะแปลงรูปภาพ {count} รูป

# readyToResize
source: Ready to resize your image?
th: พร้อมปรับขนาดรูปภาพของคุณแล้วหรือยัง?

# imageWillBeResized
source: Your image will be resized to the specified dimensions
th: รูปภาพของคุณจะถูกปรับขนาดตามที่กำหนด

source: Cancel
th: ยกเลิก

# continueAction
source: Continue
th: ดำเนินการต่อ

source: Save
th: บันทึก

source: Clear
th: ล้าง

source: Reset
th: รีเซ็ต

source: Advertisement
th: โฆษณา

source: Ad Banner Placeholder
th: พื้นที่โฆษณา

source: Appearance
th: รูปลักษณ์

source: Theme
th: ธีม

# choosePreferredTheme
source: Choose your preferred theme
th: เลือกธีมที่คุณต้องการ

source: Light
th: สว่าง

source: Dark
th: มืด

source: System
th: ระบบ

source: Conversion Defaults
th: ค่าเริ่มต้นการแปลง

source: Default Output Format
th: รูปแบบเอาต์พุตเริ่มต้น

source: Default Quality
th: คุณภาพเริ่มต้น

source: Storage
th: พื้นที่จัดเก็บ

source: Auto-save to Gallery
th: บันทึกอัตโนมัติไปยังแกลเลอรี

# automaticallySaveConverted
source: Automatically save converted images
th: บันทึกรูปภาพที่แปลงแล้วโดยอัตโนมัติ

source: Storage Location
th: ตำแหน่งจัดเก็บ

# storageLocationPath
source: Pictures/ImageConverter
th: รูปภาพ/ImageConverter

source: Advanced
th: ขั้นสูง

source: Language
th: ภาษา

source: Clear Cache
th: ล้างแคช

# freeUpStorage
source: Free up storage space
th: เพิ่มพื้นที่จัดเก็บ

source: About
th: เกี่ยวกับ

source: Version
th: เวอร์ชัน

source: Latest
th: ล่าสุด

source: Privacy Policy
th: นโยบายความเป็นส่วนตัว

# howWeHandleData
source: How we handle your data
th: วิธีที่เราจัดการข้อมูลของคุณ

source: Terms of Service
th: เงื่อนไขการให้บริการ

source: App usage terms
th: เงื่อนไขการใช้งานแอป

source: Reset to Defaults
th: รีเซ็ตเป็นค่าเริ่มต้น

source: Reset Settings?
th: รีเซ็ตการตั้งค่า?

# resetSettingsConfirm
source: This will reset all settings to their default values. This action cannot be undone.
th: การดำเนินการนี้จะรีเซ็ตการตั้งค่าทั้งหมดเป็นค่าเริ่มต้น การกระทำนี้ไม่สามารถยกเลิกได้

source: Settings reset to defaults
th: รีเซ็ตการตั้งค่าเป็นค่าเริ่มต้นแล้ว

# clearCacheQuestion
source: Clear Cache?
th: ล้างแคช?

# clearCacheDescription
source: This will clear temporary files and free up storage space. Your images and settings will not be affected.
th: การดำเนินการนี้จะล้างไฟล์ชั่วคราวและเพิ่มพื้นที่จัดเก็บ รูปภาพและการตั้งค่าของคุณจะไม่ได้รับผลกระทบ

source: Cache cleared successfully
th: ล้างแคชเรียบร้อยแล้ว

source: Select Language
th: เลือกภาษา

# languageChangedTo
source: Language changed to {language}
th: เปลี่ยนภาษาเป็น {language}

source: Storage location configuration coming soon!
th: การกำหนดค่าตำแหน่งจัดเก็บเร็วๆ นี้!

source: Privacy policy coming soon!
th: นโยบายความเป็นส่วนตัวเร็วๆ นี้!

source: Terms of service coming soon!
th: เงื่อนไขการให้บริการเร็วๆ นี้!

source: Save functionality coming soon!
th: ฟังก์ชันการบันทึกเร็วๆ นี้!

source: No images selected
th: ไม่ได้เลือกรูปภาพ

# pickImageError
source: Failed to pick image
th: ไม่สามารถเลือกรูปภาพ

# conversionError
source: Conversion failed
th: การแปลงล้มเหลว

# resizeError
source: Resize failed
th: การปรับขนาดล้มเหลว

source: Convert Your Images
th: แปลงรูปภาพของคุณ

# selectImagesToGetStarted
source: Select multiple images to get started
th: เลือกหลายรูปภาพเพื่อเริ่มต้น

source: Resize Your Images
th: ปรับขนาดรูปภาพของคุณ

source: Select an image to get started
th: เลือกรูปภาพเพื่อเริ่มต้น

# savedNImagesSuccessfully
source: Successfully saved {count} image(s)!
th: บันทึกรูปภาพสำเร็จ {count} รูป!

source: Failed to save images
th: ไม่สามารถบันทึกรูปภาพ
